word_list = ["лисица", "горшок", "помидор", "морковь", "ложка", "мостик", "столик", "кабачок", "вишня", "собака", "колода", "тарелка", "печка", "картон", "стакан", "чашка", "лавка", "баклажан", "таран", "ведро", "карандаш", "мышка", "колокол", "свеча", "весло", "комар", "лента", "пиала", "панама", "флейта", "скрипка", "колпак", "машина", "кабель", "перчатка", "баллон", "каркас", "костер", "бритва", "палка", "пряжка", "пицца", "банка", "корова", "свинья", "птица", "кошка", "крыша", "молоко", "печенье", "пирамида", "бриллиант", "пудинг", "семена", "дракон", "вымпел", "муравей", "компот", "кусачки", "мармелад", "передник", "кровать", "свитер", "слюда", "шампунь", "шкафчик", "подушка", "печенье", "коньки", "мечта", "квас", "топор", "семга", "огурец", "картошка", "белка", "палка", "книга", "дракон", "кольцо", "карандаш", "краска", "гречка", "черника", "сироп", "пылесос"]

stages = [
'''
   _______
  |/     |
  |      O
  |     /|\\
  |     / \\
  |
__|______
|       |
''',
'''
   _______
  |/     |
  |      O
  |     /|\\
  |     / 
  |
__|______
|       |
''',
'''
   _______
  |/     |
  |      O
  |     /|\\
  |     
  |
__|______
|       |
''',
'''
   _______
  |/     |
  |      O
  |     /|
  |     
  |
__|______
|       |
''',
'''
   _______
  |/     |
  |      O
  |      |
  |     
  |
__|______
|       |
''',
'''
   _______
  |/     |
  |      O
  |     
  |     
  |
__|______
|       |
''',
'''
   _______
  |/     |
  |      
  |     
  |     
  |
__|______
|       |
'''
]


logo = '''#  ╦ ╦╔═╗╔╗╔╔═╗╔╦╗╔═╗╔╗╔
#  ╠═╣╠═╣║║║║ ╦║║║╠═╣║║║
#  ╩ ╩╩ ╩╝╚╝╚═╝╩ ╩╩ ╩╝╚╝\n'''